[
  {
    "id": "vz58_p",
    "copy-from": "rifle_auto",
    "looks_like": "modular_ar15",
    "type": "GUN",
    "name": { "str": "vz. 58 combat rifle" },
    "description": "A Cold War-era Czechoslovak assault rifle, likely constructed stateside from a pre-1986 imported parts kit or brought back from a third world war zone.  Externally similar to the AK family of rifles, this weapon nevertheless only shares the former's 7.62x39mm chambering.  Featuring no interchangeable parts with its Russian doppelganger, this firearm makes use of a completely different internal operating system, is far more svelte than its other Warsaw Pact counterparts, and feeds from proprietary box magazines.",
    "weight": "2900 g",
    "volume": "2000 ml",
    "longest_side": "845 mm",
    "barrel_length": "390 mm",
    "price": "2 kUSD",
    "//": "Couldn't find exact price information on original VZ assault rifles, so did some guestimation based off of prices for similar Russian automatic weapon's's parts kits.",
    "price_postapoc": "40 USD",
    "variant_type": "gun",
    "variants": [
      {
        "id": "vz58_p",
        "name": { "str": "Samopal vz. 58 P rifle" },
        "description": "This lightweight and relatively svelte Cold War assault rifle was originally developed for use by the Czechoslovak army, in place of the various licensed Kalashnikov rifles which were then prevalent around eastern Europe.  Bearing more than a passing resemblance to the AK-47, this weapon nevertheless features a completely different array of internals and possesses no interchangeable parts with its Russian counterpart.  Making use of proprietary magazines and a 15.4 inch barrel, the vz. 58 was regarded by some to be the Kalashnikov's lesser-known superior.  Likely reconstructed from a pre-1986 imported parts kit, or brought back from a third world war zone, this particular weapon features a removable wood impregnated plastic buttstock and a 'P' suffixed designation, which both mark it as an original infantry model."
      },
      {
        "id": "vz58_v",
        "name": { "str": "Samopal VZ 58 V rifle" },
        "description": "This lightweight and relatively svelte Cold War assault rifle was originally developed for use by the Czechoslovak army, in place of the various licensed Kalashnikov rifles which were then prevalent around eastern Europe.  Bearing more than a passing resemblance to the AK-47, this weapon nevertheless features a completely different array of internals and possesses no interchangeable parts with its Russian counterpart.  Making use of proprietary magazines and a 15.4 inch barrel, the vz. 58 was regarded by some to be the Kalashnikov's lesser-known superior.  Likely reconstructed from a pre-1986 imported parts kit, or brought back from a third world war zone, this particular weapon features a removable side-folding buttstock and a 'V' suffixed designation, which both mark it as an original airborne or crew issued model."
      }
    ],
    "to_hit": -1,
    "material": [ "steel", "plastic", "wood" ],
    "color": "brown",
    "ammo": [ "762" ],
    "dispersion": 150,
    "durability": 10,
    "min_cycle_recoil": 1950,
    "modes": [ [ "DEFAULT", "semi-auto", 1 ], [ "AUTO", "auto", 4 ] ],
    "valid_mod_locations": [
      [ "barrel", 1 ],
      [ "bayonet lug", 1 ],
      [ "brass catcher", 1 ],
      [ "grip", 1 ],
      [ "mechanism", 2 ],
      [ "muzzle", 1 ],
      [ "rail mount", 1 ],
      [ "sights mount", 1 ],
      [ "sling", 1 ],
      [ "stock", 1 ],
      [ "stock accessory", 2 ],
      [ "underbarrel mount", 1 ]
    ],
    "pocket_data": [ { "pocket_type": "MAGAZINE_WELL", "item_restriction": [ "vz58mag30", "vz58mag10" ] } ],
    "melee_damage": { "bash": 12 }
  },
  {
    "id": "vz58ts",
    "copy-from": "vz58_p",
    "looks_like": "modular_ar15",
    "type": "GUN",
    "name": { "str": "vz. 58 tactical rifle" },
    "description": "Inspired and built primarily from older Czechoslovak military combat rifles, this weapon bears an uncanny resemblance to the Kalashnikov despite sharing no components with it, including magazines.  Chambering the Soviet 7.62x39mm cartridge and featuring an American produced folding buttstock, receiver, and barrel in order to comply with US importation laws, the weapon is equipped with a side mounted rail assembly as well as a detachable muzzle brake.  Despite the firearm's Cold War design being nearly 80 years old, this modern iteration makes for a relatively portable and serviceable cataclysmic problem solver.",
    "variant_type": "gun",
    "variants": [
      {
        "id": "vz58ts",
        "name": { "str": "vz. 58 Tactical Sporter rifle" },
        "description": "A modern semi-automatic clone of the Czechoslovak-produced vz. 58 assault rifle, chambered in the Soviet 7.62x39mm cartridge.  Built off of surplus vz. 58 parts, the rifle makes use of additional American made components such as the receiver, barrel, and buttstock to comply with US importation laws.  Featuring an extended 16 inch barrel, an M4 style stock adapter and tube, and an integrated side rail for optics mounting, this Cold War rifle makes for a relatively handy post-apocalyptic companion."
      }
    ],
    "price": "1 kUSD 700 USD",
    "longest_side": "868 mm",
    "barrel_length": "413 mm",
    "modes": [ [ "DEFAULT", "semi-auto", 1 ] ],
    "default_mods": [ "folding_stock", "rail_mount", "offset_sight_rail", "muzzle_brake" ]
  },
  {
    "id": "arx160",
    "copy-from": "rifle_auto",
    "looks_like": "modular_ar15",
    "type": "GUN",
    "name": { "str": "Beretta AK rifle" },
    "//": "Total unloaded weight of gun 3000 grams.  Current weight of folding stock 200 grams.",
    "description": "This rifle was a Phase II contender in the United States Army Individual Carbine competition to replace the M4 carbine.  It failed to replace it, but it is widely used by military all around the world.  This version is chambered for 7.62x39mm.",
    "variant_type": "gun",
    "variants": [
      {
        "id": "arx160",
        "name": { "str": "Beretta ARX-160 rifle" },
        "description": "The Beretta ARX-160 was a Phase II contender in the United States Army Individual Carbine competition to replace the M4 carbine.  It failed to replace it, but it is widely used by military all around the world.  This version is chambered for 7.62x39mm."
      }
    ],
    "weight": "3080 g",
    "volume": "6323 ml",
    "longest_side": "91 cm",
    "barrel_length": "406 mm",
    "price": "4 kUSD 500 USD",
    "price_postapoc": "45 USD",
    "to_hit": -1,
    "material": [ "steel" ],
    "color": "blue",
    "ammo": [ "762" ],
    "dispersion": 160,
    "durability": 9,
    "min_cycle_recoil": 1832,
    "modes": [ [ "DEFAULT", "semi-auto", 1 ], [ "AUTO", "auto", 4 ] ],
    "barrel_volume": "250 ml",
    "default_mods": [ "folding_stock" ],
    "valid_mod_locations": [
      [ "barrel", 1 ],
      [ "bayonet lug", 1 ],
      [ "brass catcher", 1 ],
      [ "grip", 1 ],
      [ "mechanism", 2 ],
      [ "muzzle", 1 ],
      [ "rail", 1 ],
      [ "sights", 1 ],
      [ "sling", 1 ],
      [ "stock", 1 ],
      [ "stock accessory", 2 ],
      [ "underbarrel", 1 ]
    ],
    "pocket_data": [ { "pocket_type": "MAGAZINE_WELL", "item_restriction": [ "akmag30", "akmag10", "akmag20", "akmag40" ] } ],
    "melee_damage": { "bash": 11 }
  }
]